/*
 * @Author: jinjf
 * @Date: 2021-09-07 14:55:05
 * @LastEditTime: 2021-09-08 09:20:39
 * @LastEditors: Please set LastEditors
 * @Description: 注释的部分先留着
 * @FilePath: /gss-datahub-web/src/pages/EduVideo/tree.ts
 */

module.exports = [
  {
    title: '基础配置中心',
    key: '01',
    children: [
      {
        title: '系统整体配置',
        key: '0101',
        children: [
          // {
          //   title: '菜单配置',
          //   key: '010101'
          // },
          {
            title: '大屏配置',
            key: '010102',
            children: [
              {
                title: '大屏基本信息配置',
                key: '01010201'
              },
              {
                title: '菜单配置',
                key: '01010202'
              },
              {
                title: '中央占位区配置',
                key: '01010203'
              },
              {
                title: '大屏组件信息配置',
                key: '01010204'
              }
            ]
          },
          {
            title: 'APP配置',
            key: '010103',
            children: [
              {
                title: '项目概况',
                key: '01010301'
              },
              {
                title: '项目大脑',
                key: '01010302'
              },
              {
                title: '智慧党建',
                key: '01010303'
              }
            ]
          }
        ]
      },
      {
        title: '账号权限管理',
        key: '0102',
        children: [
          {
            title: '菜单浏览权限',
            key: '010201'
          },
          {
            title: '报警通知权限',
            key: '010202'
          }
        ]
      }
    ]
  },
  {
    title: 'BIM应用中心',
    key: '02',
    children: [
      // { title: 'BIM模型导入', key: '0201' },
      // { title: 'BIM模型浏览', key: '0202' },
      {
        title: '模型交互配置',
        key: '0203',
        children: [
          // {
          //   title: '单模型',
          //   key: '020301'
          // },
          {
            title: '集成模型',
            key: '020302',
            children: [
              {
                title: '主视角',
                key: '02030201'
              },
              {
                title: '加载缩略图',
                key: '02030202'
              },
              {
                title: '加载漫游',
                key: '02030203'
              },
              {
                title: '人员数量区域分布',
                key: '02030204'
              },
              {
                title: '进度标识颜色',
                key: '02030205'
              },
              {
                title: '质安问题挂接',
                key: '02030206'
              },
              {
                title: '自动漫游设置',
                key: '02030207'
              },
              {
                title: '自定义路线',
                key: '02030208'
              },
              {
                title: '标签设置',
                key: '02030209'
              }
            ]
          }
          // {
          //   title: '基础平台',
          //   key: '020303'
          // }
        ]
      },
      { title: 'BIM模拟建造', key: '0204' }
    ]
  },
  {
    title: '数字工地应用中心',
    key: '03',
    children: [
      {
        title: '地图管理',
        key: '0301',
        children: [
          {
            title: '2D数字工地地图',
            key: '030101'
          },
          {
            title: '2D数字工地概况图',
            key: '030102'
          },
          {
            title: '指挥中心3D模型',
            key: '030103'
          },
          {
            title: '地图-数字工地',
            key: '030104'
          }
        ]
      },
      // {
      //   title: '线性工程工点配置',
      //   key: '0302'
      // },
      {
        title: '设备位置布置',
        key: '0303'
      }
    ]
  },
  {
    title: '业务功能中心',
    key: '04',
    children: [
      {
        title: '业务数据填报',
        key: '0401',
        children: [
          // {
          //   title: '六比六赛考评录入',
          //   key: '040101'
          // },
          // {
          //   title: '绿色施工评价录入',
          //   key: '040102'
          // },
          // {
          //   title: '经营数据录入',
          //   key: '040103'
          // },
          {
            title: '党务管理信息录入',
            key: '040104',
            children: [
              {
                title: '人员管理',
                key: '04010401'
              },
              {
                title: '党建活动公告',
                key: '04010402'
              }
            ]
          }
          // {
          //   title: '体温检测信息录入',
          //   key: '040105'
          // },
          // {
          //   title: '项目公告录入',
          //   key: '040106'
          // }
        ]
      }
      // {
      //   title: '流程规则设置',
      //   key: '0402'
      // },
      // {
      //   title: '选择进度计划',
      //   key: '0403'
      // }
    ]
  },
  {
    title: '备管理中心',
    key: '05',
    children: [
      {
        title: '设备接入配置',
        key: '0501',
        children: [
          {
            title: '设备接入配置',
            key: '050101',
            children: [
              {
                title: '设备接入配置',
                key: '05010101'
              },
              {
                title: '设备详情配置',
                key: '05010102'
              }
            ]
          },
          {
            title: '自定义设备接入配置',
            key: '050102',
            children: [
              {
                title: '设备类型接入配置',
                key: '05010201'
              },
              {
                title: '设备接入配置',
                key: '05010202'
              }
            ]
          }
        ]
      },
      {
        title: '设备参数配置',
        key: '0502',
        children: [
          {
            title: '设备参数配置',
            key: '050201',
            children: [
              {
                title: '塔吊信息配置',
                key: '05020101'
              },
              {
                title: '电梯配置',
                key: '05020102'
              },
              // {
              //   title: '履带吊配置',
              //   key: '05020103'
              // },
              {
                title: '汽车吊配置',
                key: '05020104'
              },
              // {
              //   title: '龙门吊配置',
              //   key: '05020105'
              // },
              // {
              //   title: '架桥机配置',
              //   key: '05020106'
              // },
              {
                title: '配电箱配置',
                key: '05020107'
              },
              // {
              //   title: '水表配置',
              //   key: '05020108'
              // },
              // {
              //   title: '烟感组合配置',
              //   key: '05020109'
              // },
              // {
              //   title: 'wifi教育',
              //   key: '05020110'
              // },
              // {
              //   title: '四足机器人组合配置',
              //   key: '05020111'
              // },
              {
                title: 'AR眼镜配置',
                key: '05020112'
              },
              {
                title: '螺栓监测配置',
                key: '05020113'
              }
            ]
          },
          {
            title: '设备信息管理',
            key: '050202'
          }
        ]
      },
      {
        title: '设备规则配置',
        key: '0503',
        children: [
          {
            title: '一键告警触发安全隐患流程设置',
            key: '050301'
          },
          // {
          //   title: '环境监测预报警值设置',
          //   key: '050302'
          // },
          // {
          //   title: '电子锁设置',
          //   key: '050303'
          // },
          // {
          //   title: '喷淋设置',
          //   key: '050304'
          // },
          {
            title: '基坑监测报警值设置',
            key: '050305'
          },
          {
            title: '钢结构报警值设置',
            key: '050306'
          },
          {
            title: '外墙脚手架监测报警值设置',
            key: '050307'
          },
          {
            title: '混凝土测温报警值设置',
            key: '050308'
          },
          // {
          //   title: '气体含量预警设置',
          //   key: '050309'
          // },
          {
            title: '库房报警值设置',
            key: '050310'
          },
          {
            title: '养护室报警值设置',
            key: '050311'
          },
          // {
          //   title: '盾构机监测报警值设置',
          //   key: '050312'
          // },
          // {
          //   title: '供水量控制设置',
          //   key: '050313'
          // },
          // {
          //   title: '供电量控制设置',
          //   key: '050314'
          // },
          // {
          //   title: '广播联动设置',
          //   key: '050315'
          // },
          {
            title: '视频联动设置',
            key: '050316'
          }
          // {
          //   title: '喷涂机械臂设置',
          //   key: '050317'
          // },
          // {
          //   title: '污水监测报警值设置',
          //   key: '050318'
          // },
          // {
          //   title: '考勤设备预警设置',
          //   key: '050319'
          // },
          // {
          //   title: '车辆闸机',
          //   key: '050320'
          // },
          // {
          //   title: '摄像头',
          //   key: '050321'
          // },
          // {
          //   title: '无人机设置',
          //   key: '050322'
          // },
          // {
          //   title: '消防水压报警值设置',
          //   key: '050323'
          // }
        ]
      },
      {
        title: '点位数据布置',
        key: '0504',
        children: [
          {
            title: '混凝土测温孔布置',
            key: '050401'
          },
          {
            title: '高支模地图布置',
            key: '050402'
          },
          {
            title: '基坑平面图配置',
            key: '050403'
          },
          {
            title: '钢结构平面图配置',
            key: '050404'
          },
          {
            title: '外墙脚手架平面图配置',
            key: '050405'
          }
        ]
      }
    ]
  }
  // {
  //   title: '视频管理中心',
  //   key: '06',
  //   children: [
  //     {
  //       title: '视频设备管理',
  //       key: '0601'
  //     },
  //     {
  //       title: 'AI配置管理',
  //       key: '0602'
  //     },
  //     {
  //       title: 'AR全景管理',
  //       key: '0603'
  //     }
  //   ]
  // }
];
